---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodUseRays
source: html/4928b13f-ef34-ea8d-886a-bc9ed6141f8a.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodUseRays Property

The property labeled "Use rays feature" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodUseRays { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".